{
  "experiences": [
    {
      "company": "The Digital Dude",
      "link": "https://the-digital-dude.vercel.app/",
      "position": "Software Developer",
      "location": "Dhaka, Bangladesh(Part-time, Remote)",
      "startDate": "June, 2025",
      "endDate": "Present",
      "responsibilities": [
        "Contributing to the end-to-end development and deployment of scalable web applications.",
        "Building SEO-optimized websites using Next.js, Redux, TypeScript, Framer Motion, and related technologies.",
        "Developing custom CRM solutions tailored to meet diverse professional requirements.",
        "Developing mobile apps using React Native and Expo."
      ]
    },
    {
      "company": "CSM Bangladesh Limited",
      "link": "https://www.csmbangladesh.com/",
      "position": "Software Developer",
      "location": "Dhaka, Bangladesh(On-site)",
      "startDate": "June, 2024",
      "endDate": "Present",
      "responsibilities": [
        "Creating various components and hooks in the frontend for code reusability and making response times of applications faster.",
        "Leading and contributing to the development of a HRM system that handles lunch management, employee attendance, leave management and many more."
      ]
    },
    {
      "company": "AAK TELE-SCIENCE, INC",
      "link": "https://www.linkedin.com/company/aak-telesciences/mycompany/",
      "position": "Frontend Developer(React.JS)",
      "location": "Davis, CA(Remote)",
      "startDate": "September, 2023",
      "endDate": "March, 2024",
      "responsibilities": [
        "Designed and implemented responsive interfaces for optimal user experiences.",
        "Proficient in using Redux for efficient data flow in complex applications.",
        "Created and maintained modular, reusable components for streamlined development."
      ]
    },
    {
      "company": "Innovate Wave",
      "link": "https://www.linkedin.com/company/innovate-wave/",
      "position": "Intern Fullstack Web Developer(MERN Stack)",
      "location": "Dhaka, Bangladesh(Remote)",
      "startDate": "March, 2023",
      "endDate": "August, 2023",
      "responsibilities": [
        "Contributed to full-stack development and deployment of web applications.",
        "Assisted in optimizing databases for efficient data handling.",
        "Contributed to creating and integrating RESTful APIs.",
        "Involved in developing user-friendly interfaces using modern frameworks.",
        "Worked collaboratively in an Agile environment, participating in planning and iterative development."
      ]
    },
    {
      "company": "Freelance Web Dev",
      "link": "https://bd.linkedin.com/in/atefarmanshishir/",
      "position": "Fullstack Web Developer(MERN & Django)",
      "location": "Worldwide",
      "startDate": "February, 2022",
      "endDate": "Present",
      "responsibilities": [
        "Led MERN and Django app development and deployment on cloud platforms.",
        "Managed MongoDB and PostgreSQL databases, optimizing schemas for performance.",
        "Developed RESTful APIs with Express.js as well as Django Rest Framework, integrating third-party APIs.",
        "Created responsive interfaces with React.js, using Redux for state management.",
        "Collaborated in Agile settings, ensuring timely delivery with cross-functional teams."
      ]
    }
  ],

  "projects": [
    {
      "name": "Jonobol",
      "technologies": [
        "React.JS",
        "Typescript",
        "TailwindCSS",
        "Tanstack Query",
        "Redux",
        "Node.JS",
        "Express.JS",
        "MongoDB",
        "VPS"
      ],
      "description": "Jonobol is a human resource management system built using React, TypeScript, Tailwind, Express, and MongoDB. Includes a lunch ordering system, attendance management, leave management, and many more.",
      "features": [
        "Improved admin operations by over 60% through real-time dashboards.",
        "Ensured smooth UX with Formik/Yup form validation, responsive UI using ShadCN.",
        "Advanced permission management system with permission assignment for individual users allowing fine-grained control over user privileges."
      ],
      "sourceCode": [
        {
          "label": "Private for Organization",
          "url": "#"
        },
        {
          "label": "",
          "url": ""
        }
      ],
      "liveProject": "https://hrm.csmbangladesh.com/"
    },
    {
      "name": "RentalEase",
      "technologies": [
        "React.JS",
        "Typescript",
        "SCSS",
        "Redux",
        "Node.JS",
        "Express.JS",
        "MongoDB"
      ],
      "description": "RentalEase is a property compliance management system where agencies, property managers, and technicians collaborate to manage properties, perform compliance jobs, generate reports, and handle invoices efficiently through a centralized admin dashboard.",
      "features": [
        "Streamlined workflow for managing agencies, property managers, properties, and assigned technicians.",
        "Automated compliance job scheduling, tracking, invoicing, and reporting.",
        "Centralized admin control with real-time insights and efficient job-to-invoice lifecycle management"
      ],
      "sourceCode": [
        {
          "label": "Private for Organization",
          "url": "#"
        },
        {
          "label": "",
          "url": ""
        }
      ],
      "liveProject": "https://rentalease-client.vercel.app/"
    },
    {
      "name": "ShopVibe",
      "technologies": [
        "React.JS",
        "Redux",
        "MaterialUI",
        "Node.JS",
        "Express.JS",
        "MongoDB",
        "Stripe"
      ],
      "description": "This store is built using React.JS for the frontend, Express.JS and Node.JS for the backend. MongoDB is used for the database management system. The cart functionality is created by using Redux to store the cart items. Stripe payment is available in this application. Also some MaterialUI components are used for nicer aesthetics.",
      "features": [
        "Uses can create account with their passwords hashed in the backend.",
        "Users can add products to cart and then checkout using Stripe payment gateway.",
        "Admin can manage the products, categories and user roles. Also the analytics of products and users is also available on admin panel dashboard."
      ],
      "sourceCode": [
        {
          "label": "Frontend",
          "url": "https://github.com/EvoShishir/shopping-website"
        },
        {
          "label": "Backend",
          "url": "https://github.com/EvoShishir/shopping-server"
        }
      ],
      "liveProject": "https://shopvibe-client.netlify.app/"
    },
    {
      "name": "Modern Portfolio Website",
      "technologies": ["React.JS", "Framer Motion", "Sass"],
      "description": "Explore my React.js portfolio with sleek design, Framer Motion animations, and SASS styles. Seamlessly navigate a modern interface showcasing my tech skills and innovative projects, creating a dynamic and immersive user experience.",
      "features": [
        "Ensuring optimal user experience on any device, the website seamlessly adapts to varying screen sizes.",
        "Elevating user engagement, dynamic Framer Motion animations bring a modern touch to the portfolio's visual appeal.",
        "Crafted with SASS, the styles contribute to an elegant and cohesive design, reflecting a keen eye for aesthetics."
      ],
      "sourceCode": [
        {
          "label": "Source Code",
          "url": "https://github.com/EvoShishir/shishir-portfolio"
        }
      ],
      "liveProject": "https://atefarmanshishir.netlify.app/"
    },
    {
      "name": "URL Shorty",
      "technologies": ["Django", "Ajax", "SQlite"],
      "description": "An URL shortener built using Django that will take care of long unbearable links and provide a uniquely made shortened URL, just for you, that will redirect you to your desired link. Very simple to use. Anyone can just paste a link and get it shortened for free. Links do not expire and stay the same way as you created.",
      "features": [
        "Very simple to use.",
        "Anyone can just paste a link and get it shortened for free.",
        "Links do not expire and stay the same way as you created."
      ],
      "sourceCode": [
        {
          "label": "Source Code",
          "url": "https://github.com/EvoShishir/urlshorty"
        }
      ]
    },
    {
      "name": "E-commerce API",
      "technologies": ["Django Rest Framework", "PostgreSQL"],
      "description": "This is an e-commerce API built using the Django Rest Framework with the use of Python. It features user authentication where users need to confirm their email using a confirmation link during signup. Orders are tied to user accounts, and users can create orders based on their preferences. An account requires a unique phone number for registration, and passwords can be reset using email.",
      "features": [
        "An account requires a unique phone number to register.",
        "Passwords can be reset using email."
      ],
      "sourceCode": [
        {
          "label": "Source Code",
          "url": "https://github.com/EvoShishir/EcommerceAPI"
        }
      ]
    }
  ]
}
